[
  {
    "id": "aibo",
    "title": "6G Empowered Intelligent High-Speed Railway",
    "date": "Jul. 29, 2025",
    "speaker": {
      "name": "Prof. Bo Ai",
      "affiliation": "Professor, School of Electronic and Information Engineering, Beijing Jiaotong University, Beijing, China"
    },
    "abstract": "The rapid development of high-speed railways (HSRs) has become a cornerstone of intelligent transportation systems. As HSR networks advance in speed, complexity, and scale, they impose increasingly stringent demands on next-generation communication systems—particularly in terms of reliability, latency, bandwidth, and security. This talk presents an in-depth analysis of the requirements for future intelligent HSR systems and examines how emerging 6G technologies can address these challenges. We begin with an overview of global HSR development and the growing demand for intelligent, safe, and autonomous operations. Key enabling technologies such as cross-domain channel modeling, advanced wireless coverage, ultra-reliable transmission, edge intelligence, and AI-driven security are discussed. These innovations in 6G help to significantly enhance the efficiency, safety, and intelligence of next-generation HSR networks, laying the groundwork for future high mobility infrastructure.",
    "biography": "Prof. Bo Ai (IEEE Fellow, AAIA Fellow, IET Fellow, professor and doctoral supervisor of Beijing Jiaotong University. He is the Dean of School of Electronic and Information Engineering. Prof. Bo Ai has published 6 Chinese academic books, 3 English books, over 180 IEEE journal articles. He has obtained 13 international paper awards include IEEE VTS Neil Shepherd Memorial Best Propagation Award and IEEE GLOBECOM 2018 Best Paper Award，43 invention patents; 32 proposals adopted by the ITU, 3GPP, etc., and 9 provincial and ministerial-level science and technology awards. His research results has been involved in 6 national standards. He is mainly engaged in the research and application of the theory and core technology of broadband mobile communication and rail transit dedicated mobile communication systems (GSM-R, LTE-R, 5G/6G-R, LTE-M). Prof. Bo Ai is the Fellow of Chinese Institute of Electronics, Fellow of China Institute of Communications, Chair of IEEE BTS Xi'an Branch, Vice Chair of IEEE VTS Beijing Branch, IEEE VTS distinguished lecturer, am expert of the 5G Industry Expert Group of the China Mobile Group Technical Advisory Committee，and expert of the 6G Group in China.",
    "photos": ["featured.jpg"]
  },
  {
    "id": "weigao",
    "title": "Towards Prevalence of On-Device AI with Full Runtime Adaptability",
    "date": "Mar. 27, 2025",
    "speaker": {
      "name": "Prof. Wei Gao",
      "affiliation": "Professor, University of Pittsburgh, USA"
    },
    "abstract": "With the recent democratization of AI, there is a pressing need of supporting AI on mobile and embedded devices at the edge, to allow intelligent and prompt decision making autonomously on these devices. To meet the devices' constraints in computing capacity, current software solutions to on-device AI reduce the ML model's complexity, but have major weaknesses in adapting to the changes of online data patterns and environmental contexts, resulting in significant reduction of model performance in difficult learning tasks. In this talk, I will present our recent research on achieving such full runtime adaptability, as a key enabler for prevalence of on-device AI in practical systems. I will first present how we leverage explainability in AI to adaptively involve the most appropriate model structures for on-device computations, so as to support real-time inference, runtime training and LLM fine-tuning on devices with extreme resource constraints. Afterwards, I will further show how such on-device AI techniques can be applied to various application domains, including smart healthcare and embodied AI systems, to achieve high system performance with heterogeneous data characteristics and diverse environmental settings.",
    "biography": "Wei Gao is currently an Associate Professor in the Department of Electrical and Computer Engineering, University of Pittsburgh. His research interests lie in the intersection between AI and computer systems, with a focus on the design and deployment of on-device AI models and algorithms on mobile, embedded and networked devices. He also has strong interests in applying the computationally efficient AI models into practical application domains to make societal impacts and benefit the human welfare. He has published more than 80 research papers at both top AI and system conference venues, including ICLR, AAAI, CVPR, ASPLOS, MobiCom, MobiSys, SenSys, etc, and received multiple best paper awards or nominations.",
    "photos": ["featured.jpg"]
  },
  {
    "id": "Dusit",
    "title": "Toward Scalable Generative AI via Mixture of Experts in Mobile Edge Networks",
    "date": "Dec. 17, 2024",
    "speaker": {
      "name": "Prof. Dusit Niyato",
      "affiliation": "President's Chair Professor, College of Computing & Data Science (CCDS), Nanyang Technological University, Singapore"
    },
    "abstract": "The evolution of generative artificial intelligence (GenAI) has driven revolutionary applications like ChatGPT. The proliferation of these applications is underpinned by the mixture of experts (MoE), which contains multiple experts and selectively engages them for each task to lower operation costs while maintaining performance. Despite MoE's efficiencies, GenAI still faces challenges in resource utilization when deployed on local user devices. Therefore, we first propose mobile edge networks supported MoE-based GenAI. Rigorously, we review the MoE from traditional AI and GenAI perspectives, scrutinizing its structure, principles, and applications. Next, we present a new framework for using MoE for GenAI services in Metaverse. Further, we propose a framework that transfers subtasks to devices in mobile edge networks, aiding GenAI model operation on user devices. Furthermore, we introduce a novel approach utilizing MoE, augmented with Large Language Models (LLMs), to effectively analyze user objectives and constraints of optimization problems based on deep reinforcement learning (DRL). This approach selects specialized DRL experts and weights each decision from the participating experts. In this process, the LLM acts as the gate network to oversee the expert models, facilitating a collective of experts to tackle a wide range of new tasks. Furthermore, it can also leverage LLM's advanced reasoning capabilities to manage the output of experts for joint decisions. Lastly, we insightfully identify research opportunities of MoE and mobile edge networks.",
    "biography": "Dr. Dusit Niyato is currently a President's Chair Professor in the College of Computing & Data Science (CCDS), Nanyang Technological University, Singapore. Dusit's research interests are in the areas of mobile generative AI, edge intelligence, quantum computing and networking, and incentive mechanism design. Currently, Dusit is serving as Editor-in-Chief of IEEE Communications Surveys and Tutorials (impact factor of 34.4 for 2023) and will serve as the Editor-in-Chief of IEEE Transactions on Network Science and Engineering (TNSE) from 2025. He is also an area editor of IEEE Transactions on Vehicular Technology (TVT), topical editor of IEEE Internet of Things Journal (IoTJ), lead series editor of IEEE Communications Magazine, and associate editor of IEEE Transactions on Wireless Communications (TWC), IEEE Transactions on Mobile Computing (TMC), IEEE Transactions on Information Forensics and Security (TIFS), and IEEE Transactions on Services Computing (TSC). Dusit is the Members-at-Large to the Board of Governors of IEEE Communications Society for 2024-2026. He was named the 2017-2023 highly cited researcher in computer science. He is a Fellow of IEEE and a Fellow of IET.",
    "photos": ["featured.jpg", "WechatIMG2850.jpg", "WechatIMG994.jpg", "WechatIMG995.jpg", "WechatIMG993.jpg", "WechatIMG2851.jpg"]
  },
  {
    "id": "davidAtienza",
    "title": "Accelerator-Centric Edge AI Architectures for Low-Power and Personalized Wearables",
    "date": "Dec. 3, 2024",
    "speaker": {
      "name": "Prof. David Atienza",
      "affiliation": "Professor, EPFL, Switzerland"
    },
    "abstract": "Edge AI computing is targeting multiple domains nowadays, and a new set of complementary approaches have emerged as main avenues for designing novel accelerator-centric architectures for Cyber-Physical Systems (CPS) and wearable systems. The first approach is based on integrating enhanced general-purpose components in computing systems (such as adding computing capabilities in regular memory blocks, also called in-memory computing) as part of the micro-architecture of an edge AI system that comprises validated open hardware components (processors, memories, and peripherals). The second approach includes new accelerator modules inside the final edge AI architectures as a separate co-processing module of the target application domain, enabling new domain-specific heterogeneous system-on-chip (SoC) platforms. In this lecture, Prof. Atienza will cover the pros and cons of these two approaches, focusing on how to combine both based on recent research done within the X-HEEP open-hardware SoC architectural template. In particular, it will be shown how to integrate different families of accelerators, such as in-memory vs. near-memory acceleration or systolic arrays vs. Coarse-grained reconfigurable arrays (CGRA) to design the next generation of multi-parametric edge AI wearables targeting personalized healthcare.",
    "biography": "David Atienza is a professor of Electrical and Computer Engineering, heads the Embedded Systems Laboratory (ESL), and is the Associate Vice President of Research Centers and Platforms for the period of 2024-2028 at EPFL, Switzerland. His research interests include system-level design methodologies for multi-processor system-on-chip (MPSoC) targeting low-power Cyber-Physical Systems (CPS) and energy-efficient computing servers. His latest works include new 2.5D/3D power/thermal-aware design and architectures for MPSoCs targeting edge AI systems, as well as HW/SW co-design and AI-based multi-level optimization for sustainable computing in the Internet of Things (IoT) context. Prof. David Atienza has co-authored over 450 papers, one book, and 14 patents in these previous areas. He has also received multiple recognitions and awards, among them the IEEE/ACM HW/SW Co-Design Conference (CODES-ISSS) 2024 Test-of-Time Award for the most influential paper in the last 15 years, the ICCAD 10-Year Retrospective Most Influential Paper Award in 2020, the Design Automation Conference (DAC) Under-40 Innovators Award in 2018, and IEEE CEDA and ACM SIGDA Early Career Awards on EDA tools and systems research. He is a Fellow of IEEE, Fellow of ACM, and has been the Chair of the European Design Automation Association (EDAA) since 2022 until 2024. He is currently the Editor-in-Chief of IEEE Trans. on CAD (T-CAD) and ACM Computing Surveys.",
    "photos": ["featured.png", "1.jpg", "3.jpg", "2.jpg"]
  },
  {
    "id": "24-05-13-LiuJianqing",
    "title": "Quantum Communications, Applications and Challenges",
    "date": "May 13, 2024",
    "speaker": {
      "name": "Prof. Jianqing Liu",
      "affiliation": "Assistant Professor, Department of Computer Science, North Carolina State University, USA"
    },
    "abstract": "Quantum communications is an emerging communication paradigm with no parallel in classical communication systems. It leverages the unique quantum properties of light to enable unconditionally secure communications and support new engineering applications such as distributed quantum computing and sensing. In this talk, the speaker will begin with an introduction to the basics of quantum communications and the progress of worldwide quantum communication systems. He will specifically use the well-recognized quantum application, quantum key distribution (QKD), to highlight the principles and characteristics of quantum communications. Then, he will discuss the technical challenges and open questions in the field, leading up to a presentation of his group's recent work on distributing quantum cluster states through noisy quantum channels.",
    "biography": "Dr. Jianqing Liu is an Assistant Professor at the Department of Computer Science at the NC State University, USA. Before joining NC State, he was an assistant professor at University of Alabama in Huntsville from 2018 to 2022. Dr. Liu received a BS degree in electrical engineering from UESTC, China in 2013 and a PhD degree in computer engineering from the University of Florida in 2018. His current research interests include wireless networking, differential privacy, and quantum information. Dr. Liu is the recipient of the US National Science Foundation CAREER Award in 2022 and won several best paper awards including the 2018 IEEE TCGCC Best Journal Paper Award. He currently serves on the editorial board of IEEE Transactions on Wireless Communications and IEEE Transactions on Vehicular Technology.",
    "photos": ["featured.jpg"]
  },
  {
    "id": "haibozhou",
    "title": "A Decoupled Radio Access Networks Architecture for 6G",
    "date": "Oct. 9, 2023",
    "speaker": {
      "name": "Prof. Haibo Zhou",
      "affiliation": "Professor, School of Electronic Science and Engineering, Nanjing University, China"
    },
    "abstract": "The next-generation mobile communications network is envisioned to face both significant user-side paradigm shifts and network-side challenges, including spectrum resource scarcity, increasing demand for high-quality network service provision, and proliferating network operation costs. In this talk, the speaker will first provide insights into the evolution of RAN by investigating the existing paradigms and future trends and then introduce a disruptive fully-decoupled radio access network (FD-RAN) architecture for 6G, which aligns well with the trends of integrating existing paradigms and new features such as physical decoupling of uplink and downlink base stations. With such a physical split of BS functionalities, the speaker will demonstrate how to naturally implement advanced cooperative transmission techniques such as coordinated multipoint (CoMP), receiver diversity, and hybrid duplex resource allocation and how to leverage the proposed FD-RAN architecture to enhance the spectrum utilization, reduce the network energy consumption, and improve the quality of user experience in 6G.",
    "biography": "Haibo Zhou is currently a Full Professor with the School of Electronic Science and Engineering, Nanjing University, Nanjing, China. He received the Ph.D. degree in information and communication engineering from Shanghai Jiao Tong University, Shanghai, China, in 2014. From 2014 to 2017, he was a Postdoctoral Fellow with the Broadband Communications Research Group, Department of Electrical and Computer Engineering, University of Waterloo. He has published 5 Books, 3 Book Chapters, and over 100 high-level journal papers, including 8 ESI Highly Cited Papers. He was a recipient of 8 best journal and conference paper awards, including IEEE GLOBECOM'20, VTC'2020-Fall, and the Norbert Wiener Review Award of IEEE/CAA Journal of Automatica Sinica in 2020 etc. He was a recipient of IEEE ComSoc Asia-Pacific Outstanding Young Researcher Award (2019), Chinese overseas young high-level talents (2019), Clarivate Highly Cited Researcher, and 2023-2025 IEEE VTS Distinguished Lecturer. He served as Track/Symposium Co-Chair for IEEE/CIC ICCC 2019, IEEE VTC-Fall 2020, IEEE VTC-Fall 2021, WCSP 2022, IEEE GLOBECOM 2022, IEEE ICC 2024. He is currently an Associate Editor of IEEE TWC, IEEE IoT Journal, IEEE Network Magazine. His research interests include resource management and protocol design in vehicular ad hoc networks, B5G/6G networks and space-air-ground integrated networks.",
    "photos": ["featured.jpg"]
  },
  {
    "id": "nancheng",
    "title": "RingSFL: An Adaptive Split Federated Learning Towards Taming Client Heterogeneity",
    "date": "Oct. 9, 2023",
    "speaker": {
      "name": "Prof. Nan Cheng",
      "affiliation": "Professor, School of Telecommunications Engineering, Xidian University, Xi'an, China"
    },
    "abstract": "Federated learning (FL) has gained increasing attention due to its ability to collaboratively train while protecting client data privacy. However, in most wireless networks, such as vehicular networks, client heterogeneity exists, as different vehicular users have different computation capabilities. Vanilla FL cannot handle client heterogeneity, leading to a degradation in training efficiency due to stragglers, and is still vulnerable to privacy leakage. To address these issues, we propose RingSFL, a novel distributed learning scheme that integrates FL with a model split mechanism to adapt to client heterogeneity while maintaining data privacy. In RingSFL, all clients form a ring topology. For each client, instead of training the model locally, the model is split and trained among all clients along the ring through a pre-defined direction. By properly setting the propagation lengths of heterogeneous clients, the straggler effect is mitigated, and the training efficiency of the system is significantly enhanced. Additionally, since the local models is blended, it is less likely for an eavesdropper to obtain the complete model and recover the raw data, thus improving data privacy. The experimental results on both simulation and prototype systems show that RingSFL can achieve better convergence performance than benchmark methods on independently identically distributed (IID) and non-IID datasets, while effectively preventing eavesdroppers from recovering training data.",
    "biography": "Nan Cheng received the Ph.D. degree from the Department of Electrical and Computer Engineering, University of Waterloo in 2016, and B.E. degree and the M.S. degree from the Department of Electronics and Information Engineering, Tongji University, Shanghai, China, in 2009 and 2012, respectively. He worked as a Post-doctoral fellow with the Department of Electrical and Computer Engineering, University of Toronto, from 2017 to 2019. He is currently a professor with the State Key Lab. of ISN and with the School of Telecommunications Engineering, Xidian University, Shaanxi, China. He has published over 90 journal papers in IEEE Transactions and other top journals. He serves as an associate editor of IEEE Internet of Things Journal, IEEE Transactions on Vehicular Technology, IEEE Open Journal of the Communications Society, and Peer-to-Peer Networking and Applications, and serves/served as a guest editor for several journals. His current research focuses on B5G/6G, vehicular networks, AI-driven future networks, and space-air-ground integrated networks.",
    "photos": ["featured.jpg"]
  },
  {
    "id": "weihuazhuang",
    "title": "Stochastic Cumulative DNN Inference for Intelligent IoT Applications",
    "date": "Oct. 7, 2023",
    "speaker": {
      "name": "Prof. Weihua Zhuang",
      "affiliation": "University Professor, Tier I Canada Research Chair, Department of Electrical and Computer Engineering, University of Waterloo, Canada"
    },
    "abstract": "Artificial intelligence models will continue to be pervasively deployed to support diverse intelligent Internet of Things (IoT) applications in the 5G/6G era. Many such applications rely on deep neural networks (DNN) for object classification. In this presentation, DNN inference uses a pre-trained DNN model to process an input data sample such as raw sensing data, and generates a classification result. We will discuss when to offload DNN inference computation from resource constrained IoT devices to the edge and how to incorporate different contributions from multiple random DNN inference results to improve task classification accuracy, while achieving high transmission, computation, and energy resource utilization.",
    "biography": "Weihua Zhuang is a University Professor and a Tier I Canada Research Chair in Wireless Communication Networks at University of Waterloo, Canada. Her research focuses on network architecture, algorithms and protocols, and service provisioning in future communication systems. She was the Editor-in-Chief of the IEEE Transactions on Vehicular Technology from 2007 to 2013, General Co-Chair of 2021 IEEE/CIC International Conference on Communications in China (ICCC), Technical Program Chair/Co-Chair of 2017/2016 IEEE VTC Fall, and Technical Program Symposia Chair of 2011 IEEE Globecom. She is an elected member of the Board of Governors and the President of the IEEE Vehicular Technology Society. Dr. Zhuang is a Fellow of the IEEE, Royal Society of Canada, Canadian Academy of Engineering, and Engineering Institute of Canada.",
    "photos": ["1.png", "2.JPG", "3.png", "featured.jpg"]
  },
  {
    "id": "PhoneLin",
    "title": "Data-Driven Anomaly Detection & Prediction for IoT",
    "date": "May 3, 2023",
    "speaker": {
      "name": "Prof. Phone Lin",
      "affiliation": "IEEE Fellow and IEEE VTS Distinguished Speaker, Distinguished Professor, Department of Computer Science and Information Engineering, National Taiwan University"
    },
    "abstract": "Anomaly detection/prediction usually relies on wide domain knowledge to build up the tools to automatically detect/predict abnormal events or behaviors of an IoT system. An IoT system may consist of machines with different capabilities, functionalities and ages. Abnormal events or behaviors are usually rare events. It is time-consuming and high-cost to build up the domain knowhow of the IoT systems and collect enough data points of the anomaly. In this lecture, I first identify the issues and challenges. Then I illustrate a general environment for anomaly detection/perdition. Then I will illustrate the technologies and solutions for anomaly detection/prediction, and show some prototypes and their applications.",
    "biography": "Phone Lin received his B.S. and Ph.D. degrees in Computer Science and Information Engineering from National Chiao Tung University, Hsinchu, Taiwan, in 1996 and 2001, respectively. He is currently a Distinguished Professor at National Taiwan University, where he holds a professorship within the Department of Computer Science and Information Engineering, Graduate Institute of Networking and Multimedia, and Internet of Things Research Center, College of EECS, and Graduate Institute of Medical Device and Imaging, College of Medicine. He served as the Chair of IEEE Vehicular Technology Society Taipei Chapter from 2014 to 2015. He serves on the editorial boards of several journals, such as the IEEE Wireless Communications and the IEEE Internet of Things Journal. In recognition of his research contributions, he has received numerous awards, such as the Outstanding Research Award from the Ministry of Science and Technology, Taiwan, in 2016, and the Best Young Researcher of IEEE ComSoc Asia-Pacific Young Researcher Award in 2007. He is a Fellow of IEEE.",
    "photos": ["featured.jpg"]
  },
  {
    "id": "chih-wei-huang",
    "title": "Enhancing Resource Management and Remote 3D Rendering for Future Wireless Networks",
    "date": "May 3, 2023",
    "speaker": {
      "name": "Prof. Chih-Wei Huang",
      "affiliation": "Professor, Department of Communication Engineering, National Central University, Taiwan"
    },
    "abstract": "This talk examines recent advancements in wireless networks, emphasizing their ability to support complex applications such as high-speed data transmission in multiple-input multiple-output (MIMO) systems and engaging experiences in mixed reality (MR) applications. We will discuss two research contributions that introduce innovative solutions in these fields. The first research project presents a cutting-edge framework that employs deep reinforcement learning (DRL) to optimize cross-layer resource allocation. Instead of directly assigning execution parameters, the framework automates algorithm selection based on real-time traffic conditions, resulting in improved user satisfaction rates compared to traditional cross-layer adaptation techniques. The second study investigates a remote rendering architecture specifically designed for MR applications. By incorporating localization-assisted approaches, this architecture effectively reduces streaming data volume while maintaining accurate object rendering, enabling immersive and engaging MR experiences.",
    "biography": "Dr. Chih-Wei Huang earned his B.S. from National Taiwan University in 2001, M.S. from Columbia University in 2004, and Ph.D. from University of Washington in 2009, all in electrical engineering. He is currently a Professor and heads the Information Processing and Communications (IPC) laboratory at the Department of Communication Engineering, National Central University in Taiwan. Prior to joining academia, he worked as an intern researcher at Siemens Corporate Research and Microsoft Research between 2006 and 2009. His research interests span wireless networking, multimedia communications, machine learning, digital signal processing, and information retrieval. Dr. Huang's contributions have been recognized with best paper awards from several conferences, including IEEE ICCE 2020, IEEE ICC 2018, and WOCC 2015.",
    "photos": ["featured.jpg"]
  }
]